app/controllers/user_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["username", "matty_ice"]]
---
	def show
    # response.headers['Content-Type'] = 'text/event-stream'
    # # sse = SSE.new(response.stream)
    # begin
  		# @user = User.by_uuid(params[:id]).first
    #   sse.write(@user.to_json)
    # rescue IOError
    #   puts 'Client Disconnected'
    # ensure
    #   sse.close
    # end
    # render nothing: true
    @user = User.by_username(params[:id]).first

SELECT  "users".* FROM "users" WHERE "users"."uuid" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["uuid", "c22b071d-d853-44ab-9ca2-8ef2c0efab62"]]
---
    def notify
        byebug
        @user = User.by_uuid(params[:uuid]).first

SELECT  "users".* FROM "users" WHERE "users"."username" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["username", "clark"]]
INSERT INTO "users" ("username", "uuid", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "clark"], ["uuid", "fadf2773-374b-4672-900c-13322ef96061"], ["created_at", "2016-03-02 05:26:47.854954"], ["updated_at", "2016-03-02 05:26:47.854954"]]
---
	def login
		@user = User.by_username(params['username']).first
        if @user.nil?
            uuid = SecureRandom.uuid
            @user = User.create(:username => params['username'], :uuid => uuid)