app/controllers/user_controller.rb

	def show
		@user = User.by_uuid(params[:id]).first
---
SELECT  "users".* FROM "users" WHERE "users"."uuid" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["uuid", "matty_ice"]]